////////////////////////////////////////////////////// 정의 ////////////////////////////////////////////////////
#define _CRT_SECURE_NO_WARNINGS
#define randomize() srand((unsigned)time(NULL))	
#define random(n) (rand() % (n))
#define cls system("cls")
#define delay(n) Sleep(n)
#define random_cost 1000

#include <stdio.h>
#include <stdlib.h>
#include <conio.h>
#include <windows.h>
#include <string.h>
#include <time.h>
////////////////////////////////////////////////////// 유용한 기능 함수 /////////////////////////////////////////
void gotoxy(int x, int y)
{
	COORD Cur;
	Cur.X = x;
	Cur.Y = y;
	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), Cur);
}
int wherex() // 현재 x 좌표 위치 조사
{
	CONSOLE_SCREEN_BUFFER_INFO BufInfo;

	GetConsoleScreenBufferInfo(GetStdHandle(STD_OUTPUT_HANDLE), &BufInfo);
	return BufInfo.dwCursorPosition.X;
}
int wherey() // 현재 y 좌표 위치 조사
{
	CONSOLE_SCREEN_BUFFER_INFO BufInfo;

	GetConsoleScreenBufferInfo(GetStdHandle(STD_OUTPUT_HANDLE), &BufInfo);
	return BufInfo.dwCursorPosition.Y;
}
typedef enum {
	NOCURSOR,
	SOLIDCURSOR,
	NORMALCURSOR
} CURSOR_TYPE;
typedef enum { // 색상 코드
	BLACK = 0, BLUE = 1, GREEN = 2, SKYBLUE = 3, RED = 4, PURPLE = 5, ORANGE = 6,
	WHITE = 7, GREY = 8, LIGHTBLUE = 9, LIGHTGREEN = 10, BLUEGREEN = 11, LIGHTRED = 12, LIGHTPURPLE = 13,
	YELLOW = 14, LIGHTWHITE = 15
} COLOR_TYPE;
void setcursortype(CURSOR_TYPE c)
{
	CONSOLE_CURSOR_INFO CurInfo;

	switch (c) {
	case NOCURSOR:
		CurInfo.dwSize = 1;
		CurInfo.bVisible = FALSE;
		break;
	case SOLIDCURSOR:
		CurInfo.dwSize = 100;
		CurInfo.bVisible = TRUE;
		break;
	case NORMALCURSOR:
		CurInfo.dwSize = 20;
		CurInfo.bVisible = TRUE;
		break;
	}
	SetConsoleCursorInfo(GetStdHandle(STD_OUTPUT_HANDLE), &CurInfo);
}
void setcolor(COLOR_TYPE text, COLOR_TYPE back) // 글자 색상, 글자뒤의 배경색 지정
{
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), text | (back << 4));
}
void textcolor(COLOR_TYPE text) // 글자 색상만 지정
{
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), text);
}

////////////////////////////////////////////////// 전역 변수 // 구조체 // 이미지 배열 ////////////////////////////////

int start = 0; // 플래그 변수
int total_cash = 100000; // 총 금액 변수
int speed = 800; // delay 속도 변수 delay(speed) = 0.8초 
int text_speed = 2;
int img_speed = 200;
int text_color = LIGHTWHITE;
int cursor_color = ORANGE;
char doll_shape[3] = "■";
char cursor_shape[3] = "▶";
char blank[3] = "　";
char str[40];

typedef struct doll // 인형 목록 구조체
{
	char name[30]; // 이름
	int number; // 고유 번호 1, 2, 3 ...
	int price; // 가격
	int stock; // 남은수량 (재고)
	char profile[100]; // 인형에 대한 설명

}DOLL;
DOLL doll[4] = { // 인형 구조체 변수 선언 {이름 / 고유번호 / 가격 / 재고수량 / 상세설명}
		{"인형이름 1", 1, 30000, 5, "설명내용"},
		{"인형이름 2", 2, 20000, 5, "설명내용"},
		{"인형이름 3", 3, 10000, 5, "설명내용"},
		{"인형이름 4", 4, 5000, 5, "설명내용"},
};

int doll_image_01[25][25] = {
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,15,15,15,15,15,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,15,15,14,14,14,14,14,15,15,15,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0,0,0},
	{0,0,0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0,0},
	{0,0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0,0},
	{0,0,0,0,0,15,14,14,15,0,14,14,14,14,14,14,14,15,0,14,15,0,0,0,0},
	{0,0,0,0,15,14,14,14,0,0,14,14,0,0,0,0,14,0,0,14,15,0,0,0,0},
	{0,0,0,0,15,14,14,14,0,0,14,0,4,4,4,4,0,0,0,14,15,0,0,0,0},
	{0,0,0,0,15,14,14,14,14,14,0,0,0,0,0,0,0,14,14,14,15,15,0,0,0},
	{0,0,0,15,14,14,14,14,14,14,0,4,4,4,4,4,0,14,14,14,15,14,15,0,0},
	{0,0,15,14,14,14,14,14,14,14,14,0,0,0,0,0,14,14,14,14,15,14,14,15,0},
	{0,0,15,14,14,14,0,14,14,14,14,14,14,14,14,14,14,14,14,14,15,14,14,15,0},
	{0,0,15,14,14,0,0,14,0,0,0,0,0,0,0,0,14,14,14,14,15,15,14,15,0},
	{0,0,15,14,14,0,1,1,7,7,7,7,7,7,0,0,14,14,14,14,15,0,15,15,0},
	{0,0,0,15,14,0,1,1,7,7,7,7,7,0,0,14,14,14,14,14,15,0,0,0,0},
	{0,0,0,0,15,14,14,14,0,0,0,0,0,14,14,14,14,14,14,14,15,0,0,0,0},
	{0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0},
	{0,0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0},
	{0,0,0,0,0,15,15,15,15,14,14,14,14,14,14,14,14,14,14,15,15,0,0,0,0},
	{0,0,0,0,0,15,12,12,12,15,14,14,14,14,14,14,14,15,15,12,15,15,0,0,0},
	{0,0,0,0,0,15,12,12,12,12,15,14,14,14,14,14,15,12,12,12,12,15,0,0,0},
	{0,0,0,0,0,0,15,12,12,12,15,15,15,15,15,15,15,12,12,12,12,15,0,0,0},
	{0,0,0,0,0,0,0,15,15,15,15,0,0,0,0,0,15,15,15,15,15,15,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
};
int doll_image_02[25][25] = {
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,1,9,11,1,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,1,9,11,11,1,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,1,9,9,11,1,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,1,9,9,11,8,1,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,1,9,11,11,11,8,9,1,0,0,0,0,1,1,0,0,0,0},
		{0,0,0,0,0,0,1,9,9,11,11,11,11,9,9,1,0,0,1,15,15,1,0,0,0},
		{0,0,0,0,1,1,9,9,11,11,11,11,11,9,9,9,1,1,15,11,11,1,0,0,0},
		{0,0,0,1,12,9,11,15,11,11,11,11,11,11,9,8,8,15,15,11,11,1,0,0,0},
		{0,0,0,0,1,12,9,0,11,11,11,15,11,9,12,12,8,15,9,15,15,1,0,0,0},
		{0,0,0,1,12,12,9,11,11,11,11,0,11,12,12,12,12,8,15,9,9,1,0,0,0},
		{0,0,0,0,1,1,12,15,11,11,11,11,9,12,12,12,8,8,9,9,1,0,0,0,0},
		{0,0,0,0,0,0,1,1,15,15,15,11,11,8,12,12,8,9,1,1,0,0,0,0,0},
		{0,0,0,0,0,0,0,1,1,8,9,9,11,11,8,8,9,9,1,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,1,9,15,15,9,9,9,9,8,9,1,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,1,9,9,1,8,9,9,8,1,1,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,1,1,0,1,9,9,1,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
};
int doll_image_03[25][25] = {
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,12,12,12,12,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,12,12,4,4,4,4,12,12,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,12,4,4,4,4,4,4,4,4,12,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,12,4,4,4,4,4,4,4,4,4,12,12,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,12,0,0,0,0,0,4,4,4,4,4,4,12,0,0,0,0,0,0,0},
		{0,0,0,0,12,11,11,15,15,11,11,0,4,4,4,4,4,12,0,0,0,0,0,0,0},
		{0,0,0,0,12,11,15,15,15,11,11,11,0,4,4,4,4,4,12,0,0,0,0,0,0},
		{0,0,0,12,11,15,15,15,15,11,11,11,7,0,4,4,4,4,12,12,12,0,0,0,0},
		{0,0,0,12,11,11,11,11,11,11,11,7,7,0,4,4,4,4,12,4,4,12,12,0,0},
		{0,0,0,12,11,11,11,11,11,11,7,7,0,4,4,4,4,4,12,4,4,8,12,0,0},
		{0,0,0,12,11,11,11,11,7,7,7,0,0,4,4,4,4,8,12,4,4,8,12,0,0},
		{0,0,0,0,12,0,0,0,0,0,0,4,4,4,4,4,4,8,12,4,8,8,12,0,0},
		{0,0,0,0,12,4,4,4,4,4,4,4,4,4,4,4,4,8,12,8,8,8,12,0,0},
		{0,0,0,0,12,4,4,4,4,4,4,4,4,4,4,4,8,8,12,8,8,8,12,0,0},
		{0,0,0,0,12,4,4,4,4,4,4,4,4,4,4,4,8,8,12,8,8,12,12,0,0},
		{0,0,0,0,12,4,4,4,4,4,4,4,4,4,4,8,8,8,12,12,12,0,0,0,0},
		{0,0,0,0,12,4,4,4,8,8,8,8,8,4,4,8,8,8,12,0,0,0,0,0,0},
		{0,0,0,0,0,12,8,8,12,12,12,12,12,8,8,8,8,8,12,0,0,0,0,0,0},
		{0,0,0,0,0,12,8,8,12,0,0,0,12,8,8,8,8,12,0,0,0,0,0,0,0},
		{0,0,0,0,0,12,8,8,12,0,0,0,0,12,8,8,8,12,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,12,12,0,0,0,0,0,0,12,12,12,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
};
int doll_image_04[25][25] = {
		{0,0,0,0,0,0,8,8,0,0,0,0,0,0,0,0,0,8,8,0,0,0,0,0,0},
		{0,0,0,0,0,8,1,9,8,0,0,0,0,0,0,0,8,1,9,8,0,0,0,0,0},
		{0,0,0,0,0,8,1,9,9,8,0,0,0,0,0,8,1,1,9,8,0,0,0,0,0},
		{0,0,0,0,0,8,9,9,9,9,8,8,8,8,8,1,1,9,9,8,0,0,0,0,0},
		{0,0,0,0,0,8,9,9,9,9,9,9,9,9,1,1,9,9,9,8,0,0,0,0,0},
		{0,0,0,0,8,9,9,9,9,9,9,9,15,9,9,9,9,9,9,9,8,0,0,0,0},
		{0,0,0,8,7,7,9,9,9,9,9,15,15,15,9,9,9,9,9,7,7,8,0,0,0},
		{0,0,0,8,7,15,15,15,0,15,15,15,15,15,15,15,0,15,15,15,7,8,0,0,0},
		{0,0,8,7,7,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,7,8,0,0},
		{0,0,8,7,15,15,15,15,0,0,15,15,15,15,15,0,0,15,15,15,15,15,8,0,0},
		{0,0,8,15,15,15,15,0,15,0,0,15,15,15,0,15,0,0,15,15,15,15,8,0,0},
		{0,0,8,15,15,15,15,0,0,15,0,15,15,15,0,0,15,0,15,15,15,15,8,0,0},
		{0,0,8,15,15,12,12,12,0,0,15,15,15,15,15,0,0,12,12,12,15,7,8,0,0},
		{0,0,0,8,15,12,12,12,15,15,0,15,0,15,0,15,15,12,12,12,15,8,0,0,0},
		{0,0,0,8,15,15,15,15,15,15,15,0,0,0,15,15,15,15,15,15,7,8,0,0,0},
		{0,0,0,0,8,7,15,15,15,15,15,15,15,15,15,15,15,15,15,7,8,0,0,0,0},
		{0,0,0,0,0,0,8,7,7,15,15,15,15,15,15,15,7,7,8,0,0,0,0,0,0},
		{0,0,0,0,0,8,15,15,15,15,15,15,15,15,7,7,15,15,7,8,0,0,0,0,0},
		{0,0,0,0,8,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,8,0,0,0,0},
		{0,0,0,0,8,15,8,15,15,15,15,15,15,15,15,15,15,15,8,7,8,0,0,0,0},
		{0,0,0,0,0,8,8,15,15,15,15,15,15,15,15,15,15,15,8,8,0,0,0,0,0},
		{0,0,0,0,0,0,8,15,15,15,7,7,7,7,7,15,15,15,8,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,8,15,8,8,8,8,8,8,8,15,8,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,8,7,8,0,0,0,0,0,8,7,8,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,8,8,8,0,0,0,0,0,8,8,8,0,0,0,0,0,0,0},
};

//////////////////////////////////////////////// 사용자 정의 함수 (시각 효과 관련) ////////////////////////////////////////////////

void Make_Image(int image[25][25], int x, int y) // 이미지 배열 출력 함수 (출력할 이미지 배열 이름, 시작 좌표값 필요)
{
	for (int i = 0; i < 25; i = i + 1) // y
	{
		for (int j = 0; j < 25; j = j + 1) // x
		{
			gotoxy(x + (j * 2), y + i); // 전달한 시작 좌표로 이동
			textcolor(image[i][j]); // 해당 픽셀값 전달하여 색상변환
			puts(doll_shape); // 출력
		}
	}
	textcolor(text_color); // 출력 다 끝나고 초기 색상으로 리셋
}
void Delete_Image(int x, int y)
{
	for (int i = 0; i < 25; i = i + 1) // y
	{
			gotoxy(x , y + i); // 전달한 시작 좌표로 이동
			printf("　　　　　　　　　　　　　　　　　　　　　　　　　"); // 출력
	}
}

void Text_Effect(char text[])
{
	for (int i = 0; text[i] != '\0'; i++)
	{
		putchar(text[i]);
		fflush(stdout);
		delay(text_speed);
	}
}

void Make_Frame() // 테두리 출력
{
	gotoxy(2, 1); printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); // 116
	for (int y = 2; y < 61; y++)
	{
		gotoxy(2, y); printf("■"); // 왼쪽 벽 출력
		gotoxy(232, y); printf("■"); // 오른쪽 벽 출력
	}
	gotoxy(2, 61); printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); // 116
}

void Intro_Sub() // 인트로 화면 내용
{
	gotoxy(220, 59); printf("Ver 1.0.0"); // 버젼
}
void Press_Key_Text()
{
	gotoxy(90, 55); printf("시　작　하　려　면　　아　무　키　나　　누　르　세　요");
}
void Press_Key_Delete()
{
	gotoxy(90, 55); printf("　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"); // 공백 25개
}
void Intro_Effect() // 인트로 화면
{
	for (;;)
	{
		Make_Frame(); // 테두리 출력
		Intro_Sub();
		Delete_Image(5, 19);
		Delete_Image(180, 20);
		Make_Image(doll_image_04, 5, 20);
		Make_Image(doll_image_03, 182, 20);
		Press_Key_Text();
		delay(500);
		Press_Key_Delete();
		Delete_Image(5, 20);
		Delete_Image(182, 20);
		Make_Image(doll_image_04, 5, 19);
		Make_Image(doll_image_03, 180, 20);
		if (_kbhit()) // 키 입력 받으면 탈출
		{
			_getch();
			break;
		}

		delay(500);

		if (_kbhit())
		{
			_getch();
			break;
		}
	}
}
void Intro_End()
{
	gotoxy(100, 55); printf("　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　");
	textcolor(YELLOW);
	
	for (int i = 0; i < 4; i++)
	{
		gotoxy(100, 55); printf("메　인　메　뉴　로　　이　동　합　니　다");
		delay(200);
		gotoxy(100, 55); printf("　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　");
		delay(100);
	}
	
	textcolor(text_color);
}
//////////////////////////////////////////////// 사용자 정의 함수 (기능 관련) ////////////////////////////////////////////////////

void Main_Screen(int x, int y) // 메인 메뉴 화면
{
	int menu_select = 0;
	int Distance = 4; // 간격
	Make_Image(doll_image_01, 5, 20);
	Make_Image(doll_image_02, 182, 20);
	gotoxy(110, 10);				printf("메　인　메　뉴");
	//gotoxy(x - 2, y - 1); printf("┌ "); gotoxy(x, y - 1); printf("──────────────────────"); gotoxy(x+22, y - 1); printf("┐　");
	gotoxy(x, y); printf("　　인　형　상　점"); //gotoxy(x - 1, y); printf("│"); gotoxy(x + 23, y);
	//gotoxy(x - 2, y + 1); printf("└　"); gotoxy(x-1, y + 1); printf("───────────────────────"); gotoxy(x + 22, y + 1); printf("┘　");
	gotoxy(x, y + Distance * 1); printf("　　랜　덤　뽑　기");
	gotoxy(x, y + Distance * 2); printf("　　인　형　강　화");
	gotoxy(x, y + Distance * 3); printf("　　인　형　게　임");
	gotoxy(x, y + Distance * 4); printf("　설　정　및　정　보");
	gotoxy(x, y + Distance * 5); printf("　　게　임　종　료");
	gotoxy(98, 53);			printf("현재 가지고 있는 돈 : %d 원", total_cash);
	gotoxy(94, 57);			printf("방향키로 커서를 움직인 후 엔터키를 누르세요 ");
}
void Main_Message_Delete()
{
	for (int i = 0; i < 20; i++)
	{
		gotoxy(110, 25 + i); printf("　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　");
	}
}
void Main_Help_Message(int menu_select)
{
	int start_x = 114;
	int start_y = 25;
	int distance = 4;
	switch (menu_select)
	{
	case 1:
	{
		strcpy(str, "가지고 있는 돈으로 상점에서 인형을 구매 할 수 있습니다.");
		gotoxy(start_x, start_y);
		break;
	}
	case 2 :
	{
		strcpy(str, "랜덤으로 인형을 뽑습니다. 낮은 확률로 희귀한 인형이 등장합니다.");
		gotoxy(start_x, start_y+distance);
		break;
	}
	case 3:
	{
		strcpy(str, "가지고 있는 인형을 강화하여 등급을 올릴 수 있습니다.");
		gotoxy(start_x, start_y + (distance*2));
		Text_Effect(str);
		strcpy(str, "높은 등급의 인형은 비싸게 판매할 수도 있습니다.");
		gotoxy(start_x, start_y + (distance*2)+1);
		break;
	}
	case 4 :
	{
		strcpy(str, "간단한 게임을 하여 돈을 모을 수 있습니다.");
		gotoxy(start_x, start_y + (distance * 3));
		break;
		
	}
	case 5 : 
	{
		strcpy(str, "설정을 할 수 있으며, 게임에 대한 도움말이나 정보를 보여줍니다.");
		gotoxy(start_x, start_y + (distance * 4));
		break;
	}
	case 6 :
	{
		strcpy(str, "게임을 종료합니다.");
		gotoxy(start_x, start_y + (distance * 5));
		break;
	}
	default :
	{
		gotoxy(start_x, start_y + (distance * 5));
		printf("에러 발생");
		break;
	}
	}
	
}


void Machine_Screen() // 인형 목록 화면
{
	int dollone[30][111] = {
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,8,8,0,0,0,0,0,0,0,0,0,8,8,0,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,8,1,9,8,0,0,0,0,0,0,0,8,1,9,8,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,15,15,15,15,15,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,8,1,9,9,8,0,0,0,0,0,8,1,1,9,8,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,15,15,14,14,14,14,14,15,15,15,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,12,12,12,12,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,8,9,9,9,9,8,8,8,8,8,1,1,9,9,8,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,1,9,11,1,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,12,12,4,4,4,4,12,12,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,8,9,9,9,9,9,9,9,9,1,1,9,9,9,8,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0,0,15,0,0,0,0,0,0,0,1,9,11,11,1,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,12,4,4,4,4,4,4,4,4,12,0,0,0,0,0,0,0,0,15,0,0,0,0,8,9,9,9,9,9,9,9,15,9,9,9,9,9,9,9,8,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0,0,15,0,0,0,0,0,0,0,1,9,9,11,1,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,12,4,4,4,4,4,4,4,4,4,12,12,0,0,0,0,0,0,0,15,0,0,0,8,7,7,9,9,9,9,9,15,15,15,9,9,9,9,9,7,7,8,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,15,14,14,15,0,14,14,14,14,14,14,14,15,0,14,15,0,0,0,0,15,0,0,0,0,0,0,0,1,9,9,11,8,1,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,12,0,0,0,0,0,4,4,4,4,4,4,12,0,0,0,0,0,0,15,0,0,0,8,7,15,15,15,0,15,15,15,15,15,15,15,0,15,15,15,7,8,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,15,14,14,14,0,0,14,14,0,0,0,0,14,0,0,14,15,0,0,0,0,15,0,0,0,0,0,0,1,9,11,11,11,8,9,1,0,0,0,0,1,1,0,0,0,15,0,0,0,12,11,11,15,15,11,11,0,4,4,4,4,4,12,0,0,0,0,0,0,15,0,0,8,7,7,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,7,8,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,15,14,14,14,0,0,14,0,4,4,4,4,0,0,0,14,15,0,0,0,0,15,0,0,0,1,1,9,9,11,11,11,11,11,9,9,9,1,1,15,11,11,1,0,0,15,0,0,0,12,11,15,15,15,11,11,11,0,4,4,4,4,4,12,0,0,0,0,0,15,0,0,8,7,15,15,15,15,0,0,15,15,15,15,15,0,0,15,15,15,15,15,8,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,15,14,14,14,14,14,0,0,0,0,0,0,0,14,14,14,15,15,0,0,0,15,0,0,1,12,9,11,15,11,11,11,11,11,11,9,8,8,15,15,11,11,1,0,0,15,0,0,12,11,15,15,15,15,11,11,11,7,0,4,4,4,4,12,12,12,0,0,0,15,0,0,8,15,15,15,15,0,15,0,0,15,15,15,0,15,0,0,15,15,15,15,8,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,15,14,14,14,14,14,14,0,4,4,4,4,4,0,14,14,14,15,14,15,0,0,15,0,0,0,1,12,9,0,11,11,11,15,11,9,12,12,8,15,9,15,15,1,0,0,15,0,0,12,11,11,11,11,11,11,11,7,7,0,4,4,4,4,12,4,4,12,12,0,15,0,0,8,15,15,15,15,0,0,15,0,15,15,15,0,0,15,0,15,15,15,15,8,0,0,15},
		{0,0,0,0,0,0,0,15,0,15,14,14,14,14,14,14,14,14,0,0,0,0,0,14,14,14,14,15,14,14,15,0,15,0,0,1,12,12,9,11,11,11,11,0,11,12,12,12,12,8,15,9,9,1,0,0,15,0,0,12,11,11,11,11,11,11,7,7,0,4,4,4,4,4,12,4,4,8,12,0,15,0,0,8,15,15,12,12,12,0,0,15,15,15,15,15,0,0,12,12,12,15,7,8,0,0,15},
		{0,0,0,0,0,0,0,15,0,15,14,14,14,0,14,14,14,14,14,14,14,14,14,14,14,14,14,15,14,14,15,0,15,0,0,0,1,1,12,15,11,11,11,11,9,12,12,12,8,8,9,9,1,0,0,0,15,0,0,12,11,11,11,11,7,7,7,0,0,4,4,4,4,8,12,4,4,8,12,0,15,0,0,0,8,15,12,12,12,15,15,0,15,0,15,0,15,15,12,12,12,15,8,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,15,14,14,0,0,14,0,0,0,0,0,0,0,0,14,14,14,14,15,15,14,15,0,15,0,0,0,0,0,1,1,15,15,15,11,11,8,12,12,8,9,1,1,0,0,0,0,15,0,0,0,12,0,0,0,0,0,0,4,4,4,4,4,4,8,12,4,8,8,12,0,15,0,0,0,8,15,15,15,15,15,15,15,0,0,0,15,15,15,15,15,15,7,8,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,15,14,14,0,1,1,7,7,7,7,7,7,0,0,14,14,14,14,15,0,15,15,0,15,0,0,0,0,0,0,1,1,8,9,9,11,11,8,8,9,9,1,0,0,0,0,0,15,0,0,0,12,4,4,4,4,4,4,4,4,4,4,4,4,8,12,8,8,8,12,0,15,0,0,0,0,8,7,15,15,15,15,15,15,15,15,15,15,15,15,15,7,8,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,15,14,0,1,1,7,7,7,7,7,0,0,14,14,14,14,14,15,0,0,0,0,15,0,0,0,0,0,0,0,1,9,15,15,9,9,9,9,8,9,1,0,0,0,0,0,15,0,0,0,12,4,4,4,4,4,4,4,4,4,4,4,8,8,12,8,8,8,12,0,15,0,0,0,0,0,0,8,7,7,15,15,15,15,15,15,15,7,7,8,0,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,15,14,14,14,0,0,0,0,0,14,14,14,14,14,14,14,15,0,0,0,0,15,0,0,0,0,0,0,0,1,9,9,1,8,9,9,8,1,1,0,0,0,0,0,0,15,0,0,0,12,4,4,4,4,4,4,4,4,4,4,4,8,8,12,8,8,12,12,0,15,0,0,0,0,0,8,15,15,15,15,15,15,15,15,7,7,15,15,7,8,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,15,14,14,14,14,14,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0,15,0,0,0,0,0,0,0,0,1,1,0,1,9,9,1,0,0,0,0,0,0,0,0,15,0,0,0,12,4,4,4,4,4,4,4,4,4,4,8,8,8,12,12,12,0,0,0,15,0,0,0,0,8,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,8,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,15,14,14,14,14,14,14,14,14,14,14,14,14,14,14,15,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,15,0,0,0,12,4,4,4,8,8,8,8,8,4,4,8,8,8,12,0,0,0,0,0,15,0,0,0,0,8,15,8,15,15,15,15,15,15,15,15,15,15,15,8,7,8,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,15,15,15,15,14,14,14,14,14,14,14,14,14,14,15,15,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,12,8,8,12,12,12,12,12,8,8,8,8,8,12,0,0,0,0,0,15,0,0,0,0,0,8,8,15,15,15,15,15,15,15,15,15,15,15,8,8,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,15,12,12,12,15,14,14,14,14,14,14,14,15,15,12,15,15,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,12,8,8,12,0,0,0,12,8,8,8,8,12,0,0,0,0,0,0,15,0,0,0,0,0,0,8,15,15,15,7,7,7,7,7,15,15,15,8,0,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,15,12,12,12,12,15,14,14,14,14,14,15,12,12,12,12,15,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,12,8,8,12,0,0,0,0,12,8,8,8,12,0,0,0,0,0,0,15,0,0,0,0,0,0,0,8,15,7,7,7,7,7,7,7,15,8,0,0,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,15,12,12,12,15,15,15,15,15,15,15,12,12,12,12,15,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,12,12,0,0,0,0,0,0,12,12,12,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,8,15,8,8,8,8,8,8,8,15,8,0,0,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,0,15,15,15,15,0,0,0,0,0,15,15,15,15,15,15,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,8,7,8,0,0,0,0,0,8,7,8,0,0,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,8,8,8,0,0,0,0,0,8,8,8,0,0,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15},
		{0,0,0,0,0,0,0,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15},
	};
	for (int i = 0; i < 30; i = i + 1) // y
	{
		for (int j = 0; j < 111; j = j + 1) // x
		{
			gotoxy((j * 2) + 4, i); // 해당 배열의 좌표로 이동
			textcolor(dollone[i][j]); // 해당 픽셀값 전달하여 색상변환
			puts(doll_shape); // 출력
		}
	}
	textcolor(text_color); // 출력 다 끝나고 초기 색상으로 리셋
	printf("\n"); // 한 행이 끝난 후 줄바꿈
	printf("　　　　　　　　　┌━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┐ ┌━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┐ ┌━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┐ ┌━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┐ \n");
	printf("　　　　　　　　　│　 　　 　　 　　▶◀ 푹찍이 ▶◀ 　　　 　　 　│ │　 　　 　　　▶◀ 물찍이 ▶◀ 　　　　 　 　│ │　 　　 　　 　▶◀ 어몽이 ▶◀ 　　　　　 　│ │　 　　 　　 　 　▶◀ 치냥이 ▶◀ 　　　　 　  　│ \n");
	printf("　　　　　　　　　└━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┘ └━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┘ └━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┘ └━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┘ \n");

	gotoxy(2, 50);

}


int Cash_System_Print(int x, int y) // 금액 투입 시스템 1 (출력 / 입력 기능)
{
	int Distance = 1;
	int cash_select = 0;
	gotoxy(x, y); printf("");
	gotoxy(x, y + Distance); printf("< 1 > 50000원");
	gotoxy(x, y + Distance * 2); printf("< 2 > 10000원");
	gotoxy(x, y + Distance * 3); printf("< 3 > 5000원");
	gotoxy(x, y + Distance * 4); printf("< 4 > 1000원");
	gotoxy(x, y + Distance * 5); printf("");
	gotoxy(x, y + Distance * 6); printf("< 7 > 투입 금액 반환");
	gotoxy(x, y + Distance * 7); printf("< 8 > 이전 단계 이동");
	gotoxy(x, y + Distance * 8); printf("< 9 > 다음 단계 이동");
	gotoxy(x, y + Distance * 9); printf("");
	gotoxy(x, y + Distance * 10); printf("< 현재 투입 총 금액 : %d 원 >", total_cash);
	gotoxy(x, y + Distance * 11); printf("");
	gotoxy(x, y + Distance * 12); printf("어떤 지폐를 투입 하시겠습니까? ");
	scanf("%d", &cash_select);
	return cash_select;
}
void Cash_System_Calculate(int cash_select, int x, int y) // 금액 투입 시스템 2 (충전 기능)
{
	char str[50];
	gotoxy(x, y);
	switch (cash_select) // 지폐 선택 [3]
	{
	case 1: // 5만원권을 선택한경우
	{
		strcpy(str, "< 5만원권을 투입하였습니다 >");
		Text_Effect(str);
		total_cash = total_cash + 50000;
		delay(speed);
		break;
	}
	case 2: // 1만원권 
	{
		strcpy(str, "< 1만원권을 투입하였습니다 >");
		Text_Effect(str);
		total_cash = total_cash + 10000;
		delay(speed);
		break;
	}
	case 3: // 5천원권
	{
		strcpy(str, "< 5천원권을 투입하였습니다 >");
		Text_Effect(str);
		total_cash = total_cash + 5000;
		delay(speed);
		break;
	}
	case 4: // 1천원권
	{
		strcpy(str, "< 1천원권을 투입하였습니다 >");
		Text_Effect(str);
		total_cash = total_cash + 1000;
		delay(speed);
		break;
	}
	case 7: // 환불
	{
		strcpy(str, "< 전액 환불 처리 되었습니다. >");
		Text_Effect(str);
		gotoxy(x, y + 1);
		strcpy(str, "환불 금액 : ");
		Text_Effect(str);
		printf("%d", total_cash);
		strcpy(str, "원");
		Text_Effect(str);
		total_cash = 0;
		delay(speed);
		break;
	}
	case 8: // 뒤로가기
	{
		strcpy(str, "<<< 이전 메뉴로 이동합니다 >>>");
		Text_Effect(str);
		delay(speed);
		start = -1;
		break;
	}
	case 9: // 투입 완료
	{
		strcpy(str, "<<< 다음 단계로 이동합니다 >>>");
		Text_Effect(str);
		start = 1; // 플래그 변수 전환 >> 탈출 후 인형뽑기로 진입
		delay(speed);
		break;
	}
	default:
	{
		strcpy(str, "잘못된 입력입니다.");
		Text_Effect(str);
		delay(speed);
		break;
	}
	}
}

int Machine_System_Print(int x, int y) // 인형 자판기 시스템 1 (출력 / 입력)
{
	int Distance = 1;
	int doll_select = 0;

	gotoxy(x, y); printf(""); // (80, 40)
	gotoxy(x, y + Distance); printf("< 1번 인형 > 가격 : %d 원 // 남은수량 : %d 개", doll[0].price, doll[0].stock);
	gotoxy(x, y + Distance * 2); printf("< 2번 인형 > 가격 : %d 원 // 남은수량 : %d 개", doll[1].price, doll[1].stock);
	gotoxy(x, y + Distance * 3); printf("< 3번 인형 > 가격 : %d 원 // 남은수량 : %d 개", doll[2].price, doll[2].stock);
	gotoxy(x, y + Distance * 4); printf("< 4번 인형 > 가격 : %d 원 // 남은수량 : %d 개", doll[3].price, doll[3].stock);
	gotoxy(x, y + Distance * 5); printf("< 8번 : 이전 메뉴로 이동 >");
	gotoxy(x, y + Distance * 6); printf("< 현재 투입 금액 : %d 원 >", total_cash);
	gotoxy(x, y + Distance * 7); printf("");
	gotoxy(x, y + Distance * 8); printf("뽑으실 인형의 번호를 선택해주세요 : "); // (80, 48) 다음줄 (80, 49)
	scanf("%d", &doll_select);
	return doll_select;
}
void Machine_System_Activate(int n, int x, int y) // 인형 자판기 시스템 2 (결제)
{
	char str[50];
	gotoxy(x, y);
	switch (n) // n = doll_select
	{
	case 1:
	case 2:
	case 3:
	case 4: // 인형 선택시 // 간소화 후 1~4의 경우를 모두 따로 적을 필요가 없음, 동일한 코드니 통일
	{
		if (total_cash < doll[n - 1].price) // 금액이 부족한경우
		{
			strcpy(str, "금액이 부족합니다.");
			Text_Effect(str);
			delay(speed);
			break;
		}
		else if (total_cash >= doll[n - 1].price) // 금액이 충분한 경우인데,
		{
			if (doll[n - 1].stock >= 1) // 재고가 있는경우 > 구매 성공
			{
				strcpy(str, "구매에 성공하였습니다.");
				Text_Effect(str);
				total_cash = total_cash - doll[n - 1].price;
				doll[n - 1].stock = doll[n - 1].stock - 1;
				delay(speed);
				break;
			}
			else if (doll[n - 1].stock <= 0) // 재고가 없는경우
			{
				strcpy(str, "남은 수량이 없습니다.");
				Text_Effect(str);
				delay(speed);
				break;
			}
		}
	}
	case 8: // 뒤로가기
	{
		start = 0; // 플래그 변수 초기화
		strcpy(str, "<<< 이전 메뉴로 이동합니다 >>>");
		Text_Effect(str);
		delay(speed);
		break;
	}
	default:
	{
		strcpy(str, "잘못 입력하였습니다");
		Text_Effect(str);
		delay(speed);
		break;
	}
	}
}

void Randomize_Doll_Stock(int n) // 인형 수량 랜덤화
{
	for (int i = 0; i < 4; i++)
	{
		doll[i].stock = random(n - 1) + 1; // 재고수량 랜덤 배정
	}
}

void Random_Game_Screen_Print(int x, int y) // 랜덤 뽑기 화면 출력
{
	int Distance = 1;
	gotoxy(x, y);				printf("<< 랜덤 뽑기 >>");
	gotoxy(x, y + Distance * 1); printf("----------------------------");
	gotoxy(x, y + Distance * 2); printf("1등 인형 당첨 확률 : 1%%");
	gotoxy(x, y + Distance * 3); printf("2등 인형 당첨 확률 : 4%%");
	gotoxy(x, y + Distance * 4); printf("3등 인형 당첨 확률 : 15%%");
	gotoxy(x, y + Distance * 5); printf("4등 인형 당첨 확률 : 30%%");
	gotoxy(x, y + Distance * 6); printf("꽝 확률 : 50%%");
	gotoxy(x, y + Distance * 7); printf("----------------------------");
}
int Random_Game_Message(int x, int y)
{
	int Distance = 1;
	int input = 0;
	gotoxy(x, y);				printf("< 1 > 랜덤 뽑기 진행 ");
	gotoxy(x, y + Distance * 1); printf("< 8 > 뒤로가기");
	gotoxy(x, y + Distance * 2); printf("----------------------------");
	gotoxy(x, y + Distance * 3); printf("현재 투입된 금액 : %d 원", total_cash);
	gotoxy(x, y + Distance * 4); printf("----------------------------");
	gotoxy(x, y + Distance * 5); printf("선택하세요 : ");
	scanf("%d", &input);
	return input;
}

void Random_Game_Start(int game_menu_select, int x, int y)
{
	int dice = random(100);
	gotoxy(x, y);
	switch (game_menu_select)
	{
	case 1: // 진행을 선택했는데,
	{
		if (total_cash < random_cost) // 돈이 부족한경우
		{
			printf("투입 금액이 부족합니다.");
			delay(speed);
			break;
		}
		else if (total_cash >= random_cost) // 돈이 충분한경우
		{
			printf("뽑기를 진행합니다.");
			delay(speed);
			total_cash = total_cash - random_cost;
			gotoxy(x, y + 1);
			if (dice < 1) // 0 = 1%
			{
				printf("1등 당첨 !!! dice값 : %d", dice);
				delay(speed);
			}
			else if (dice >= 1 && dice < 5) // 1~4 = 4%
			{
				printf("2등 당첨 !!! dice값 : %d", dice);
				delay(speed);
			}
			else if (dice >= 5 && dice < 20) // 5~20 15%
			{
				printf("3등 당첨 !!! dice값 : %d", dice);
				delay(speed);
			}
			else if (dice >= 20 && dice < 50) // 30%
			{
				printf("3등 당첨 !!! dice값 : %d", dice);
				delay(speed);
			}
			else if (dice >= 50 && dice < 100) // 50%
			{
				printf("꽝입니다... dice값 : %d", dice);
				delay(speed);
			}
			else
			{
				printf("알 수 없는 오류");
				delay(speed);
			}
		}
		break;
	}
	case 8: // 뒤로 이동
	{
		start = 0;
		printf("이전 메뉴로 이동합니다.");
		delay(speed);
		break;
	}
	default:
	{
		printf("잘못된 입력입니다.");
		delay(speed);
		break;
	}
	}
}

void Setting_Screen(int x, int y) // 환경 설정 메뉴
{
	int input = 0;
	gotoxy(x, y);
	printf("< 1 > 작동 속도 설정");
	printf("< 2 > 텍스트 출력 속도 설정");
	printf("< 3 > 애니메이션 속도 설정");
	printf("< 4 > 글씨 색상 설정");
	printf("< 5 > 테두리 모양 설정");
	printf("< 6 > 관리자 모드");
	printf("< 8 > 이전 메뉴로 이동");
	printf("설정하실 메뉴 번호를 입력하세요 : ");
	scanf("%d", &input);
}
void Information_Screen(int x, int y) // 도움말, 제작자 메뉴
{
	gotoxy(x, y);
	printf("< 도움말 >");
	printf("");
	gotoxy(x, y + 20);
	printf("< 만든사람들 >");
	printf("백성진 : ");
	printf("구윤서 : ");
	printf("류호환 : ");
	printf("정찬욱 : ");
	gotoxy(x, y + 30);
	printf("< 기타 >");
	printf("제작 기간 : 2024년 10월 31일 - 2024년 11월 일");
	printf("소속 : 대구 경북산업직업전문학교 ( AI 빅데이터 풀스택 개발자 과정반 - 3 팀 )");
	printf("");
}
void Exit_Screen(int x, int y)
{
	gotoxy(x, y);
	printf("프로그램을 종료합니다.\n");
}

//////////////////////////////////////////////////// 메인 ////////////////////////////////////////////////////////

void main()
{
	//int main_menu_cursor_input = 0; 커서 시스템 적용시 사용할 변수
	//int menu_choice = 1; // 현재 선택한 값
	
	int cash_select = 1;	// 투입 금액 변수
	
	int input = 0;
	int main_cur_x = 76;
	int main_cur_y = 25;
	int main_select = 1;

	ShowWindow(GetConsoleWindow(), SW_MAXIMIZE);		// 창크기 전체화면
	setcolor(LIGHTWHITE, BLACK);	// 기본 글자 색상
	setcursortype(NORMALCURSOR);		// 커서 타입
	randomize();					// 랜덤함수사용
	Randomize_Doll_Stock(5);		// 재고 랜덤 1~5개 배정
	Intro_Effect();					// 인트로 출력
	Intro_End();
	cls;

	for (;;)	// 프로그램 시작	// 메인 무한 반복
	{
		cls;
		int menu_input = 0;	// 메인 메뉴 선택 변수
		start = 0;		// 플래그 변수
		Make_Frame();
		Main_Screen(80, 25); // 메뉴 선택화면 출력 함수
		gotoxy(80, 23);
		printf("main_select : %d", main_select);
		gotoxy(80, 24);
		printf("input : %d", input);
		gotoxy(main_cur_x, main_cur_y);
		textcolor(cursor_color);
		puts(cursor_shape);
		textcolor(text_color);
		Main_Message_Delete();
		Main_Help_Message(main_select);
		Text_Effect(str);
		gotoxy(80, 23);
		printf("main_select : %d", main_select);
		gotoxy(80, 24);
		printf("input : %d", input);
		_getch(); // 이곳에 텍스트 이펙트 사용시 버그
		if (_kbhit())
		{
			input = _getch(); // 키 인식
		}
		switch (input)
		{
		case 80: // 아래
		{
			gotoxy(main_cur_x, main_cur_y);
			puts(blank);
			main_cur_y = main_cur_y + 4;
			main_select = main_select + 1;
			if (main_cur_y > 45) // 예외처리
			{
				main_cur_y = main_cur_y - 4;
				main_select = main_select - 1;
			}
			break;
		}
		case 72: // 위
		{
			gotoxy(main_cur_x, main_cur_y);
			puts(blank);
			main_cur_y = main_cur_y - 4;
			main_select = main_select - 1;
			if (main_cur_y < 25) // 예외처리
			{
				main_cur_y = main_cur_y + 4;
				main_select = main_select + 1;
			}
			break;
		}
		case 13:
		{
			menu_input = main_select;
			break;
		}
		default:
		{
			input = 0;
			break;
		}
		}
		
		/*if (input == 80) // 아래키
		{
			gotoxy(main_cur_x, main_cur_y);
			puts(blank);
			main_cur_y = main_cur_y + 4;
			main_select = main_select + 1;

		}
		else if (input == 72) // 윗키
		{
			gotoxy(main_cur_x, main_cur_y);
			puts(blank);
			main_cur_y = main_cur_y - 4;
			main_select = main_select - 1;
		}
		else if (input == 13) // 엔터키
		{
			menu_input = main_select;
		}
		else // 다른 입력
		{
			input = 0;
		}
		*/
		
		

		///////////////////////////////////////////////////////////////////////// 메뉴 진입 //////////////////////////////////////////////////////////////////////////
		switch (menu_input) // 메인 메뉴 선택 [1]
		{
		case 1: // 1번메뉴 인형뽑기 진입 [2]
		{
			start = 0; // 플래그 변수 초기화 //
			for (; start == 0;) // 인형뽑기의 금액투입 반복 구문 [2] (플래그 변수 start가 0 일 경우 무한 실행)
			{
				cls;
				Machine_Screen(); // 인형 목록
				Make_Frame();
				
				cash_select = Cash_System_Print(80, 35); // 출력 및 입력 받기 함수 좌표에 출력
				Cash_System_Calculate(cash_select, 80, 50); // 계산 및 좌표에 출력

				for (; start == 1;) // 인형뽑기 무한 반복 구문 (플래그 변수가 1 일경우)
				{
					int doll_select = 0;
					cls;

					Make_Frame();
					Machine_Screen();
					doll_select = Machine_System_Print(80, 40); // 해당좌표에 출력
					Machine_System_Activate(doll_select, 80, 49);
				}
				if (start == -1)
				{
					break;
				}
			}// for(;;)
			break;
		} // case 1 인형 뽑기 메뉴 진입

		case 2: // 2번 메뉴 랜덤 뽑기 메뉴 진입
		{

			start = 0; // 플래그 변수 초기화 //
			for (; start == 0;) // 금액 투입 진행
			{
				cls;
				Make_Frame();
				Random_Game_Screen_Print(80, 35); // 확률 표 출력
				cash_select = Cash_System_Print(80, 43); // 출력 및 입력 받기 함수 좌표에 출력
				Cash_System_Calculate(cash_select, 80, 58); // 계산 및 좌표에 출력

				for (; start == 1;) // 랜덤 게임 진행
				{
					int random_menu_select = 0;
					cls;
					Make_Frame();
					Random_Game_Screen_Print(80, 46);
					random_menu_select = Random_Game_Message(80, 43);
					Random_Game_Start(random_menu_select, 80, 50);

				}
				if (start == -1)
				{
					break;
				}
			} // for (start == 0);
			break;
		} // case 2 :



		case 3: // 3번 메뉴 미구현
		{
			break;
		}
		case 4: // 환경설정
		{
			Setting_Screen(80, 20);
			_getch();
			break;
		}
		case 5: // 도움말 // 정보
		{
			cls;
			Information_Screen(80, 20);
			_getch();
			break;
		}
		case 6: // 종료
		{
			cls;
			Exit_Screen(80, 20);
			exit(0);
		}
		default: // 잘못입력된경우 (메인메뉴)
		{
			break;
		}

		} // 메인 메뉴 switch

	} // for(;;) = 메인 메뉴 반복

} // void main ()